#!/usr/bin/env python
# -*- coding: UTF-8 -*-

#-------------------------------------------------------------------------------
# Name:        модуль1
# Purpose:
#
# Author:      Prapor
#
# Created:     20.10.2017
# Copyright:   (c) Prapor 2017
# Licence:     <your licence>
#-------------------------------------------------------------------------------

#   "mock" - более интелектуальная заглушка
#Библиотека unittest.mock предоставляет "mock" объекты.
#Идея такая, что мы заменяем функцию, которая возможно ещё не написана или не
#передана вам от другого разработчика, но необходимая для тестирования ваших
#компонент, "mock" функцией из библиотеки unittest.mock


def main():
    pass

if __name__ == '__main__':
    main()
